sudo cp -fr 文件/文件夹 目的地址 强制递归复制

chmod 666 文件 更改权限 read write

chomd 777 文件 让当前文件具备全部权限 read write x



vim 常用命令

移动光标 HJKL

进入插入模式 i 在当前光标处进入插入   Esc退出插入模式

u   进行编辑回撤

行数 + G   进入指定行数

G or :$   进入最后一行

连续摁两次d   可直接删除当前行

n[行数] + 两次d   可删除从当前行+n行的数据

o直接   直接在当前行新起一空行且进入插入模式

yy   复制当前光标行整行内容

p   粘贴

n+yy    复制n行

v + (HJKL)   移动光标至欲复制内容结尾,点击y可选择复制

v + (HJKL)   移动光标至欲替换内容结尾,点击p可覆盖粘贴


命令行模式
:E  打开当前文件所在路径下的列表页,在当前页可进行其他文件的查看;将光标移动到想要查看的文件,执行回车即可进	入其vi模式
:sp 水平分屏
:vs 垂直分屏
注意:光标移动   ctrl + w + (HJKL)
:q 退出当前光标所在分屏(等同于退出vim命令)


最终 做完修改后  需要执行保存

:w

:wq   保存完直接退出
